# DuctSizeIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSizeIterator Class
Members See Also
---
An iterator to a set of MEP duct sizes from DuctSizes.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class DuctSizeIterator : IEnumerator<MEPSize>
```

Visual Basic
---
```text
Public Class DuctSizeIterator _
	Implements IEnumerator(Of MEPSize)
```

Visual C++
---
```text
public ref class DuctSizeIterator : IEnumerator<MEPSize^>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Mechanical..::..DuctSizeIterator
# See Also
DuctSizeIterator Members
Autodesk.Revit.DB.Mechanical Namespace